<?php

namespace Database\Seeders;

use App\Models\Movies;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class MoviesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
       Movies::factory()->create([
            'title' => 'Памфір',
            'description'=>'Події фільму розгортаються в Західній Україні напередодні традиційного карнавалу Маланка. Памфір повертається додому після тривалої відсутності, щоб возз’єднатися з родиною. Безумовна любов сім’ї Памфіра має побічну дію і змушує його звернути на ризикований шлях з незворотними наслідками.',
           'release_date'=>'2024-04-01',
           'duration_minutes'=>102,
           'poster_url'=>'MoviesImages/pamfir.jpg'
         ]);
        Movies::factory()->create([
            'title' => 'Я, «ПОБЄДА» І БЕРЛІН ',
            'description'=>'Шалені 90-ті. За три дні до запланованого концерту музикант-початківець Кузьма вирушає зі своїм другом Бардом до Берліна на старій «Побєді». Кажуть, там є колекціонер, готовий обміняти жовту бестію на шестисотий «Мерс». Кузьма обіцяє своїй дівчині Барбарі повернутися додому на новій тачці, а хлопцям з гурту - встигнути на виступ. Вже з перших хвилин подорожі все, звісно, йде не за планом. Проте точно відомо одне: пригода допоможе героям знайти справжнє призначення.',
            'release_date'=>'2024-05-01',
            'duration_minutes'=>104,
            'poster_url'=>'MoviesImages/IaPobedaIBerlin.jpg'
        ]);
        Movies::factory()->create([
            'title' => 'Стоп-земля ',
            'description'=>'16-річна Маша вчиться в звичайній київській школі в 11-А класі. Не почуватися дивно та відсторонено в колективі їй допомагають близькі друзі Яна та Сєня, по-своєму переживаючи напружену шкільну буденність. Окрім майбутніх екзаменів вийти з зони комфорту Машу змушує закоханість в однокласника Сашу. Вона розуміє, якщо не наважишся спитати – ніколи не знатимеш, чи це взаємно.',
            'release_date'=>'2024-05-03',
            'duration_minutes'=>122,
            'poster_url'=>'MoviesImages/stopZemlia.jpg'
        ]);
        Movies::factory()->create([
            'title' => 'Довбуш ',
            'description'=>'арпати на початку XVIII століття. Жорстоке правління польської шляхти змушує гуцулів тікати в гори. Двоє братів, Олекса та Іван Довбуші, опиняються поза законом і стають опришками. У пошуках помсти панам за вбивство батьків Довбушів, брати стають ворогами один одному. Один прагне грошей, другий – справедливості. Гуцули починають повстання, яке очолює Олекса. Шляхта робить усе можливе, аби знищити Довбуша. Але він їх перехитрив. І розрослася легенда про карпатського лицаря. Легенда, що надихає покоління тих, хто бореться за свободу рідної землі. Про силу і любов Олекси Довбуша, про зраду і кривду. Про те, як він жив і як обманув смерть.',
            'release_date'=>'2024-05-03',
            'duration_minutes'=>122,
            'poster_url'=>'MoviesImages/dovbush.jpg'
        ]);
        Movies::factory()->create([
            'title' => 'Мої думки тихі ',
            'description'=>'Складно назвати життя Вадима успішним – невдач в особистому житті та на роботі набагато більше, ніж будь-яких хороших моментів. А працює хлопець звукорежисером. Поки це йому грошей багато не приносить, але він сподівається на прорив. Одна канадська компанія вирішила дати йому шанс – потрібно всього лише записати звуки закарпатських тварин для створення гри. А якщо зможе ще й дати їм крякання рахівського крижня, то взагалі запросять на роботу до Канади. Вадим розуміє, що це його можливість виїхати з України у краще життя. У цій подорожі компанію йому вирішила скласти мама – сім`я ж так мало часу проводить разом, а тут такий шанс. Звичайно ж, Вадим не сильно радий такому попутникові, адже це обіцяє чимало неприємних ситуацій і розмов...',
            'release_date'=>'2024-05-06',
            'duration_minutes'=>122,
            'poster_url'=>'MoviesImages/moiDumkyTyhi.jpg'
        ]);
        Movies::factory()->create([
            'title' => 'Я і Фелікс ',
            'description'=>'Розповідь про дорослішання хлопця Тимофія, його родину, друзів, перше кохання, і відносини з колишнім контррозвідником Феліксом, який став частиною його сім’ї. Історія розвивається на тлі буремних 1990-х та розказана через призму дитячого сприйняття...',
            'release_date'=>'2024-05-03',
            'duration_minutes'=>122,
            'poster_url'=>'MoviesImages/IaIFelix.jpg'
        ]);
        Movies::factory()->create([
            'title' => 'Додому ',
            'description'=>'Війна не щадить нікого... Їй абсолютно все одно за ким прийти й у кого забрати життя. На жаль, на теренах сучасної України як раз зараз відбуваються бойові дії, де мало не кожен день гинуть люди. Сім`я Мустафи, глибоко віруючого кримськотатарського мусульманина, втратила старшого сина на ім`я Назім. Мустафа хоче поховати хлопця на батьківщині, у Криму. Для цього треба поїхати до Києва та забрати його тіло. Чоловік наполіг у колі сім`ї на те, що разом із ним поїде його молодший син Алім, із яким вони разом дотримаються 40 днів жалоби. Це подорож не буде легкою ні для батька, ні для сина, але вона багато їм допоможе зрозуміти.',
            'release_date'=>'2024-05-03',
            'duration_minutes'=>122,
            'poster_url'=>'MoviesImages/dodomu.jpg'
        ]);
}
}
